app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 4]]
---
    def index
      favorites = Favorite.where(user_id: current_user.id )

INSERT INTO "favorites" ("drink_id", "name", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      favorite = Favorite.new(favorite_params)
      favorite.user = current_user

      if favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 5]]
---
    def destroy
     favorite = Favorite.find(params[:id])
     favorite.destroy