thirsty/app/controllers/favorites_controller.rb

    def index
      favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def create
      favorite = Favorite.new(favorite_params)
      favorite.user = current_user

      if favorite.save
---
INSERT INTO "favorites" ("drink_id", "name", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
     favorite = Favorite.find(params[:id])
     favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 5]]